In [273]:
import pandas as pd

In [274]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

1. Display top 3 Rows of the dataset

In [275]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

2. Check the last 3 Rows of the dataset

In [276]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

3. Find shape of Our Dataset (Number of Rows & Number of columns)

In [277]:
df1.shape

print("Total Number of Rows",df1.shape[0]) # number of rows
print("Toal Number of columns",df1.shape[1]) # nuumber of columns

Total Number of Rows 7
Toal Number of columns 3

4. Get information About Our Dataset Like Total Number Rows, Total Number of Coumns, Datatypes of Each Columns And Memory Requriement

In [278]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

5. Check Null Values In The Dataset

In [279]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

6. Get the Overall Statistics About The Dataset

In [280]:
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [281]:
df1.describe(include="all")

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

7. Find Unique Values From The Gender Column

In [282]:
df1["Gender"].unique()

array(['Male', 'Female'], dtype=object)

8. Find the Number of Unique Values from the Gender Column

In [283]:
df1["Gender"].nunique()

2

9. Display Count of Unique Values from the Gender Column

In [284]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

10. Find Toaal Number of Students who got marks above 90 To 100 (inclusive) Using Between Method

In [285]:
df1[df1["Marks"]>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [286]:
df1[(df1["Marks"]>=90) & (df1["Marks"]<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [287]:
len(df1[(df1["Marks"]>=90) & (df1["Marks"]<=100)])

4

In [288]:
sum(df1['Marks'].between(90,100))

4

11. Find Average Marks

In [289]:
df1['Marks'].mean()

np.float64(92.14285714285714)

12. Apply Method

In [290]:
def marks(x):
    return x//2

In [291]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [292]:
df1['half_marks']=df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [293]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [294]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

13. Map

In [295]:
df1['Male_female']=df1['Gender'].map({'Male':1,'Female':0})
df1

      Name  Marks  Gender  half_marks  Male_female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

14. Drop the Column(s)

In [296]:
df1.drop('Male_female',axis=1)

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [297]:
df1.drop(['Male_female','half_marks'],axis=1, inplace=True)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

15. Print Name of the Columns

In [298]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [301]:
df1.index

RangeIndex(start=0, stop=7, step=1)

16. Sort The DataFrame As Per The Marks Column

In [303]:
df1.sort_values(by="Marks",ascending=False )

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

17. Display Name & Marks of the Female Students

In [306]:
df1[df1['Gender']== 'Female'][['Name','Marks','Gender']]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [308]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks','Gender']]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female